; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_11 ?v9 ?v13)
             (pred_2 ?v4 ?v3)
             (pred_5 ?v9 ?v3)
             (pred_4 ?v1 ?v9 )
	     (pred_12 ?v9)
             (pred_8 ?v8)
             (pred_10 ?v4)
             (pred_9 ?v3)
             (pred_7 ?v9)
             (pred_6 ?v4)
             (pred_3 ?v9)
             (pred_1 ))



(:action op_3
:parameters (?v6 ?v5 ?v10 ?v11)
:precondition (and (pred_8 ?v6) (pred_8 ?v5) (pred_10 ?v10) (pred_9 ?v11)
          (pred_11 ?v6 ?v5) (pred_2 ?v10 ?v11)
                   (pred_5 ?v5 ?v11) (pred_12 ?v6) 
                   (pred_7 ?v5) (pred_6 ?v10))
:effect (and  (pred_3 ?v5) (not (pred_7 ?v5))))


(:action op_2
:parameters (?v6 ?v2)
:precondition (and (pred_8 ?v6) (pred_8 ?v2)
               (pred_12 ?v6) (pred_11 ?v6 ?v2) (pred_3 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v6))))

(:action op_5
:parameters (?v6 ?v10)
:precondition (and (pred_8 ?v6) (pred_10 ?v10) 
                  (pred_12 ?v6) (pred_4 ?v10 ?v6) (pred_1 ))
:effect (and (pred_6 ?v10)
   (not (pred_4 ?v10 ?v6)) (not (pred_1 ))))


(:action op_1
:parameters (?v6 ?v12 ?v7)
:precondition (and (pred_8 ?v6) (pred_10 ?v12) (pred_10 ?v7)
                  (pred_12 ?v6) (pred_6 ?v7) (pred_4 ?v12 ?v6))
:effect (and (pred_6 ?v12) (pred_4 ?v7 ?v6)
        (not (pred_6 ?v7)) (not (pred_4 ?v12 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_8 ?v6) (pred_10 ?v10) 
                  (pred_12 ?v6) (pred_6 ?v10))
:effect (and (pred_1 ) (pred_4 ?v10 ?v6) (not (pred_6 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_28 obj_06 obj_17 obj_12 obj_03 obj_29 obj_30 obj_01 obj_11 obj_14 obj_19 obj_13 obj_16 obj_18 obj_25 obj_22 obj_04 obj_24 obj_09 obj_31 obj_23 obj_05 obj_02 obj_26 obj_15
    obj_10 obj_21 obj_08
    obj_07 obj_20 obj_27
    )

    (:init
       (pred_1)

       (pred_8 obj_28)
       (pred_8 obj_06)
       (pred_8 obj_17)
       (pred_8 obj_12)
       (pred_8 obj_03)
       (pred_8 obj_29)
       (pred_8 obj_30)
       (pred_8 obj_01)
       (pred_8 obj_11)
       (pred_8 obj_14)
       (pred_8 obj_19)
       (pred_8 obj_13)
       (pred_8 obj_16)
       (pred_8 obj_18)
       (pred_8 obj_25)
       (pred_8 obj_22)
       (pred_8 obj_04)
       (pred_8 obj_24)
       (pred_8 obj_09)
       (pred_8 obj_31)
       (pred_8 obj_23)
       (pred_8 obj_05)
       (pred_8 obj_02)
       (pred_8 obj_26)
       (pred_8 obj_15)
       (pred_9 obj_10)
       (pred_9 obj_21)
       (pred_9 obj_08)
       (pred_10 obj_07)
       (pred_10 obj_20)
       (pred_10 obj_27)

       (pred_11 obj_28 obj_29)
       (pred_11 obj_28 obj_06)
       (pred_11 obj_06 obj_30)
       (pred_11 obj_06 obj_17)
       (pred_11 obj_06 obj_28)
       (pred_11 obj_17 obj_01)
       (pred_11 obj_17 obj_12)
       (pred_11 obj_17 obj_06)
       (pred_11 obj_12 obj_11)
       (pred_11 obj_12 obj_03)
       (pred_11 obj_12 obj_17)
       (pred_11 obj_03 obj_14)
       (pred_11 obj_03 obj_12)
       (pred_11 obj_29 obj_19)
       (pred_11 obj_29 obj_30)
       (pred_11 obj_29 obj_28)
       (pred_11 obj_30 obj_13)
       (pred_11 obj_30 obj_01)
       (pred_11 obj_30 obj_06)
       (pred_11 obj_30 obj_29)
       (pred_11 obj_01 obj_16)
       (pred_11 obj_01 obj_11)
       (pred_11 obj_01 obj_17)
       (pred_11 obj_01 obj_30)
       (pred_11 obj_11 obj_18)
       (pred_11 obj_11 obj_14)
       (pred_11 obj_11 obj_12)
       (pred_11 obj_11 obj_01)
       (pred_11 obj_14 obj_25)
       (pred_11 obj_14 obj_03)
       (pred_11 obj_14 obj_11)
       (pred_11 obj_19 obj_22)
       (pred_11 obj_19 obj_13)
       (pred_11 obj_19 obj_29)
       (pred_11 obj_13 obj_04)
       (pred_11 obj_13 obj_16)
       (pred_11 obj_13 obj_30)
       (pred_11 obj_13 obj_19)
       (pred_11 obj_16 obj_24)
       (pred_11 obj_16 obj_18)
       (pred_11 obj_16 obj_01)
       (pred_11 obj_16 obj_13)
       (pred_11 obj_18 obj_09)
       (pred_11 obj_18 obj_25)
       (pred_11 obj_18 obj_11)
       (pred_11 obj_18 obj_16)
       (pred_11 obj_25 obj_31)
       (pred_11 obj_25 obj_14)
       (pred_11 obj_25 obj_18)
       (pred_11 obj_22 obj_23)
       (pred_11 obj_22 obj_04)
       (pred_11 obj_22 obj_19)
       (pred_11 obj_04 obj_05)
       (pred_11 obj_04 obj_24)
       (pred_11 obj_04 obj_13)
       (pred_11 obj_04 obj_22)
       (pred_11 obj_24 obj_02)
       (pred_11 obj_24 obj_09)
       (pred_11 obj_24 obj_16)
       (pred_11 obj_24 obj_04)
       (pred_11 obj_09 obj_26)
       (pred_11 obj_09 obj_31)
       (pred_11 obj_09 obj_18)
       (pred_11 obj_09 obj_24)
       (pred_11 obj_31 obj_15)
       (pred_11 obj_31 obj_25)
       (pred_11 obj_31 obj_09)
       (pred_11 obj_23 obj_05)
       (pred_11 obj_23 obj_22)
       (pred_11 obj_05 obj_02)
       (pred_11 obj_05 obj_04)
       (pred_11 obj_05 obj_23)
       (pred_11 obj_02 obj_26)
       (pred_11 obj_02 obj_24)
       (pred_11 obj_02 obj_05)
       (pred_11 obj_26 obj_15)
       (pred_11 obj_26 obj_09)
       (pred_11 obj_26 obj_02)
       (pred_11 obj_15 obj_31)
       (pred_11 obj_15 obj_26)
       (pred_7 obj_24)
       (pred_7 obj_05)
       (pred_7 obj_09)
       (pred_5  obj_24 obj_10)
       (pred_5  obj_05 obj_21)
       (pred_5  obj_09 obj_08)
       (pred_3 obj_28)
       (pred_3 obj_06)
       (pred_3 obj_17)
       (pred_3 obj_12)
       (pred_3 obj_03)
       (pred_3 obj_29)
       (pred_3 obj_30)
       (pred_3 obj_01)
       (pred_3 obj_11)
       (pred_3 obj_14)
       (pred_3 obj_19)
       (pred_3 obj_13)
       (pred_3 obj_16)
       (pred_3 obj_18)
       (pred_3 obj_25)
       (pred_3 obj_22)
       (pred_3 obj_04)
       (pred_3 obj_31)
       (pred_3 obj_23)
       (pred_3 obj_02)
       (pred_3 obj_26)
       (pred_3 obj_15)

       (pred_2  obj_07 obj_10)
       (pred_2  obj_20 obj_21)
       (pred_2  obj_27 obj_08)
       (pred_4 obj_07 obj_18)
       (pred_4 obj_20 obj_15)
       (pred_4 obj_27 obj_26)
       (pred_12 obj_17)
    )

    (:goal (and
       (pred_4 obj_07 obj_30)
       (pred_4 obj_20 obj_22)
    ))
(:constraints
  (always (not (pred_12 obj_11)))
)
)

; plan
1. (op_2 obj_17 obj_01)
   deleted: (pred_12 obj_17)
   added: (pred_12 obj_01)
   goals met: 0 of 2
2. (op_2 obj_01 obj_16)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_16)
   goals met: 0 of 2
3. (op_2 obj_16 obj_18)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_18)
   goals met: 0 of 2
4. (op_5 obj_18 obj_07)
   deleted: (pred_4 obj_07 obj_18) (pred_1)
   added: (pred_6 obj_07)
   goals met: 0 of 2
5. (op_2 obj_18 obj_16)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_16)
   goals met: 0 of 2
6. (op_2 obj_16 obj_13)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_13)
   goals met: 0 of 2
7. (op_2 obj_13 obj_30)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_30)
   goals met: 0 of 2
8. (op_4 obj_30 obj_07)
   deleted: (pred_6 obj_07)
   added: (pred_1) (pred_4 obj_07 obj_30)
   goals met: 1 of 2
9. (op_2 obj_30 obj_13)
   deleted: (pred_12 obj_30)
   added: (pred_12 obj_13)
   goals met: 1 of 2
10. (op_2 obj_13 obj_16)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_16)
   goals met: 1 of 2
11. (op_2 obj_16 obj_18)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_18)
   goals met: 1 of 2
12. (op_2 obj_18 obj_25)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_25)
   goals met: 1 of 2
13. (op_2 obj_25 obj_31)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_31)
   goals met: 1 of 2
14. (op_2 obj_31 obj_15)
   deleted: (pred_12 obj_31)
   added: (pred_12 obj_15)
   goals met: 1 of 2
15. (op_5 obj_15 obj_20)
   deleted: (pred_4 obj_20 obj_15) (pred_1)
   added: (pred_6 obj_20)
   goals met: 1 of 2
16. (op_2 obj_15 obj_26)
   deleted: (pred_12 obj_15)
   added: (pred_12 obj_26)
   goals met: 1 of 2
17. (op_2 obj_26 obj_02)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_02)
   goals met: 1 of 2
18. (op_3 obj_02 obj_05 obj_20 obj_21)
   deleted: (pred_7 obj_05)
   added: (pred_3 obj_05)
   goals met: 1 of 2
19. (op_2 obj_02 obj_05)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_05)
   goals met: 1 of 2
20. (op_2 obj_05 obj_04)
   deleted: (pred_12 obj_05)
   added: (pred_12 obj_04)
   goals met: 1 of 2
21. (op_2 obj_04 obj_22)
   deleted: (pred_12 obj_04)
   added: (pred_12 obj_22)
   goals met: 1 of 2
22. (op_4 obj_22 obj_20)
   deleted: (pred_6 obj_20)
   added: (pred_1) (pred_4 obj_20 obj_22)
   goals met: 2 of 2
